In [1]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit',np.nan,'Jannat'],'class':['btech','Mtech','bca','BBA','Btech',np.nan],'marks':[12,np.nan,15,21,24,np.nan]})
df

     name  class  marks
0   Komal  btech   12.0
1  Surbhi  Mtech    NaN
2   Anmol    bca   15.0
3   Rohit    BBA   21.0
4     NaN  Btech   24.0
5  Jannat    NaN    NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   class   5 non-null      object
 2   marks   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [6]:
df.isnull()

    name  class  marks
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False  False
4   True  False  False
5  False   True   True

In [7]:
df.isna()

    name  class  marks
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False  False
4   True  False  False
5  False   True   True

In [10]:
df[df.name.isnull()]

  name  class  marks
4  NaN  Btech   24.0

In [11]:
df[df.marks.isnull()]

     name  class  marks
1  Surbhi  Mtech    NaN
5  Jannat    NaN    NaN

In [14]:
df.count()

name     5
class    5
marks    4
dtype: int64

In [15]:
df.notna()

    name  class  marks
0   True   True   True
1   True   True  False
2   True   True   True
3   True   True   True
4  False   True   True
5   True  False  False

In [16]:
df.dropna(axis=0)

    name  class  marks
0  Komal  btech   12.0
2  Anmol    bca   15.0
3  Rohit    BBA   21.0

In [18]:
df.marks.fillna(df.marks.mean())

0    12.0
1    18.0
2    15.0
3    21.0
4    24.0
5    18.0
Name: marks, dtype: float64

In [19]:
df

     name  class  marks
0   Komal  btech   12.0
1  Surbhi  Mtech    NaN
2   Anmol    bca   15.0
3   Rohit    BBA   21.0
4     NaN  Btech   24.0
5  Jannat    NaN    NaN

In [20]:
df.isnull().any()

name     True
class    True
marks    True
dtype: bool

In [22]:
df.isnull().sum()

name     1
class    1
marks    2
dtype: int64

In [23]:
user= pd.read_csv('user.csv')

In [24]:
user.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [25]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [26]:
user.shape

(400, 5)

In [29]:
user[user.loc[:,'Gender']=='Male']

      User ID Gender  Age  EstimatedSalary  Purchased
0    15624510   Male   19            19000          0
1    15810944   Male   35            20000          0
4    15804002   Male   19            76000          0
5    15728773   Male   27            58000          0
8    15600575   Male   25            33000          0
..        ...    ...  ...              ...        ...
390  15807837   Male   48            33000          1
391  15592570   Male   47            23000          1
393  15635893   Male   60            42000          1
396  15706071   Male   51            23000          1
398  15755018   Male   36            33000          0

[196 rows x 5 columns]

In [31]:
user[(user.loc[:,'Gender']=='Male') & (user.loc[:,'EstimatedSalary']>120000)]

      User ID Gender  Age  EstimatedSalary  Purchased
48   15727696   Male   30           135000          1
97   15582492   Male   28           123000          1
168  15789815   Male   29           148000          1
211  15735878   Male   52           150000          1
219  15732987   Male   59           143000          1
222  15694879   Male   37           144000          1
227  15685346   Male   56           133000          1
240  15701537   Male   42           149000          1
261  15680587   Male   36           144000          1
284  15638646   Male   48           141000          0
290  15586757   Male   39           134000          1
308  15596761   Male   36           125000          1
336  15664907   Male   58           144000          1
339  15665760   Male   39           122000          1
360  15577514   Male   43           129000          1
373  15708791   Male   59           130000          1

In [32]:
user[(user.loc[:,'Gender']=='Male') & (user.loc[:,'EstimatedSalary']>120000)].reset_index()

    index   User ID Gender  Age  EstimatedSalary  Purchased
0      48  15727696   Male   30           135000          1
1      97  15582492   Male   28           123000          1
2     168  15789815   Male   29           148000          1
3     211  15735878   Male   52           150000          1
4     219  15732987   Male   59           143000          1
5     222  15694879   Male   37           144000          1
6     227  15685346   Male   56           133000          1
7     240  15701537   Male   42           149000          1
8     261  15680587   Male   36           144000          1
9     284  15638646   Male   48           141000          0
10    290  15586757   Male   39           134000          1
11    308  15596761   Male   36           125000          1
12    336  15664907   Male   58           144000          1
13    339  15665760   Male   39           122000          1
14    360  15577514   Male   43           129000          1
15    373  15708791   Male   59           130000          1

In [34]:
df.dropna(ignore_index=True)

    name  class  marks
0  Komal  btech   12.0
1  Anmol    bca   15.0
2  Rohit    BBA   21.0

In [35]:
for i in df.iterrows():
    print(i)

(0, name     Komal
class    btech
marks     12.0
Name: 0, dtype: object)
(1, name     Surbhi
class     Mtech
marks       NaN
Name: 1, dtype: object)
(2, name     Anmol
class      bca
marks     15.0
Name: 2, dtype: object)
(3, name     Rohit
class      BBA
marks     21.0
Name: 3, dtype: object)
(4, name       NaN
class    Btech
marks     24.0
Name: 4, dtype: object)
(5, name     Jannat
class       NaN
marks       NaN
Name: 5, dtype: object)

In [36]:
# pip install openpyxl
# pd.read_excel()